kafka/gce/bench-results.bak/direct/2016-07-06.11-06/producers/client-1.log
2016:07:06 09:07:02,1514 records sent, 302.8 records/sec (29.57 MB/sec), 60.1 ms avg latency, 405.0 max latency.
2016:07:06 09:07:07,1529 records sent, 305.7 records/sec (29.85 MB/sec), 3.4 ms avg latency, 63.0 max latency.
2016:07:06 09:07:12,1519 records sent, 303.8 records/sec (29.67 MB/sec), 10.3 ms avg latency, 241.0 max latency.
2016:07:06 09:07:17,1525 records sent, 304.6 records/sec (29.74 MB/sec), 2.9 ms avg latency, 63.0 max latency.
2016:07:06 09:07:22,1536 records sent, 307.2 records/sec (30.00 MB/sec), 2.6 ms avg latency, 77.0 max latency.
2016:07:06 09:07:27,1533 records sent, 306.5 records/sec (29.94 MB/sec), 2.1 ms avg latency, 42.0 max latency.
2016:07:06 09:07:32,1546 records sent, 309.2 records/sec (30.20 MB/sec), 4.0 ms avg latency, 66.0 max latency.
2016:07:06 09:07:37,1542 records sent, 308.2 records/sec (30.10 MB/sec), 3.2 ms avg latency, 86.0 max latency.
2016:07:06 09:07:42,1544 records sent, 308.8 records/sec (30.16 MB/sec), 2.1 ms avg latency, 39.0 max latency.
2016:07:06 09:07:47,1536 records sent, 307.0 records/sec (29.98 MB/sec), 6.7 ms avg latency, 180.0 max latency.
2016:07:06 09:07:53,1546 records sent, 309.1 records/sec (30.18 MB/sec), 2.6 ms avg latency, 61.0 max latency.
2016:07:06 09:07:58,1545 records sent, 308.9 records/sec (30.17 MB/sec), 2.0 ms avg latency, 37.0 max latency.
2016:07:06 09:08:03,1516 records sent, 303.2 records/sec (29.61 MB/sec), 2.5 ms avg latency, 95.0 max latency.
2016:07:06 09:08:08,1571 records sent, 314.2 records/sec (30.68 MB/sec), 5.2 ms avg latency, 96.0 max latency.
2016:07:06 09:08:13,1550 records sent, 309.8 records/sec (30.26 MB/sec), 4.9 ms avg latency, 62.0 max latency.
2016:07:06 09:08:18,1545 records sent, 308.9 records/sec (30.16 MB/sec), 2.1 ms avg latency, 39.0 max latency.
2016:07:06 09:08:23,1538 records sent, 307.6 records/sec (30.04 MB/sec), 19.0 ms avg latency, 335.0 max latency.
2016:07:06 09:08:28,1547 records sent, 309.4 records/sec (30.21 MB/sec), 9.0 ms avg latency, 196.0 max latency.
2016:07:06 09:08:33,1538 records sent, 307.6 records/sec (30.04 MB/sec), 2.2 ms avg latency, 42.0 max latency.
2016:07:06 09:08:38,1541 records sent, 308.1 records/sec (30.09 MB/sec), 2.1 ms avg latency, 42.0 max latency.
2016:07:06 09:08:43,1543 records sent, 308.6 records/sec (30.14 MB/sec), 4.0 ms avg latency, 90.0 max latency.
2016:07:06 09:08:48,1545 records sent, 308.9 records/sec (30.17 MB/sec), 2.2 ms avg latency, 44.0 max latency.
2016:07:06 09:08:53,1544 records sent, 308.7 records/sec (30.14 MB/sec), 2.1 ms avg latency, 38.0 max latency.
2016:07:06 09:08:58,1551 records sent, 310.1 records/sec (30.28 MB/sec), 15.4 ms avg latency, 302.0 max latency.
2016:07:06 09:09:03,1545 records sent, 308.9 records/sec (30.16 MB/sec), 13.1 ms avg latency, 262.0 max latency.
2016:07:06 09:09:08,1545 records sent, 308.9 records/sec (30.16 MB/sec), 2.4 ms avg latency, 54.0 max latency.
2016:07:06 09:09:13,1547 records sent, 309.4 records/sec (30.21 MB/sec), 2.1 ms avg latency, 45.0 max latency.
2016:07:06 09:09:18,1548 records sent, 309.5 records/sec (30.22 MB/sec), 16.4 ms avg latency, 321.0 max latency.
2016:07:06 09:09:23,1549 records sent, 309.8 records/sec (30.25 MB/sec), 2.3 ms avg latency, 42.0 max latency.
2016:07:06 09:09:28,1545 records sent, 309.0 records/sec (30.18 MB/sec), 2.1 ms avg latency, 40.0 max latency.
2016:07:06 09:09:33,1548 records sent, 309.3 records/sec (30.20 MB/sec), 10.0 ms avg latency, 132.0 max latency.
2016:07:06 09:09:38,1542 records sent, 308.3 records/sec (30.11 MB/sec), 8.1 ms avg latency, 162.0 max latency.
2016:07:06 09:09:43,1546 records sent, 309.1 records/sec (30.18 MB/sec), 2.3 ms avg latency, 41.0 max latency.
2016:07:06 09:09:48,1544 records sent, 308.7 records/sec (30.15 MB/sec), 5.2 ms avg latency, 91.0 max latency.
2016:07:06 09:09:53,1542 records sent, 308.4 records/sec (30.12 MB/sec), 16.3 ms avg latency, 291.0 max latency.
2016:07:06 09:09:58,1537 records sent, 307.3 records/sec (30.01 MB/sec), 2.8 ms avg latency, 49.0 max latency.
2016:07:06 09:10:03,957 records sent, 190.8 records/sec (18.63 MB/sec), 834.6 ms avg latency, 1797.0 max latency.
2016:07:06 09:10:08,1405 records sent, 281.0 records/sec (27.44 MB/sec), 997.7 ms avg latency, 1835.0 max latency.
2016:07:06 09:10:13,889 records sent, 177.7 records/sec (17.35 MB/sec), 1321.6 ms avg latency, 2207.0 max latency.
2016:07:06 09:10:18,680 records sent, 135.2 records/sec (13.20 MB/sec), 2284.8 ms avg latency, 2980.0 max latency.
2016:07:06 09:10:23,988 records sent, 197.4 records/sec (19.28 MB/sec), 1751.7 ms avg latency, 2552.0 max latency.
2016:07:06 09:10:28,859 records sent, 171.8 records/sec (16.78 MB/sec), 1851.0 ms avg latency, 2284.0 max latency.
2016:07:06 09:10:33,1017 records sent, 202.9 records/sec (19.82 MB/sec), 1694.6 ms avg latency, 2065.0 max latency.
2016:07:06 09:10:38,1556 records sent, 311.2 records/sec (30.39 MB/sec), 1015.9 ms avg latency, 1699.0 max latency.
2016:07:06 09:10:43,796 records sent, 158.9 records/sec (15.52 MB/sec), 1968.8 ms avg latency, 2402.0 max latency.
2016:07:06 09:10:48,1994 records sent, 398.6 records/sec (38.93 MB/sec), 893.4 ms avg latency, 2185.0 max latency.
2016:07:06 09:10:53,1440 records sent, 287.9 records/sec (28.12 MB/sec), 1244.2 ms avg latency, 2004.0 max latency.
2016:07:06 09:10:58,1427 records sent, 285.3 records/sec (27.87 MB/sec), 989.9 ms avg latency, 1655.0 max latency.
2016:07:06 09:11:03,4085 records sent, 816.3 records/sec (79.72 MB/sec), 412.0 ms avg latency, 1648.0 max latency.
2016:07:06 09:11:08,1530 records sent, 305.9 records/sec (29.88 MB/sec), 8.0 ms avg latency, 182.0 max latency.
2016:07:06 09:11:13,1536 records sent, 307.0 records/sec (29.98 MB/sec), 2.2 ms avg latency, 60.0 max latency.
2016:07:06 09:11:18,1548 records sent, 309.5 records/sec (30.22 MB/sec), 2.0 ms avg latency, 47.0 max latency.
2016:07:06 09:11:23,1551 records sent, 310.1 records/sec (30.29 MB/sec), 19.2 ms avg latency, 360.0 max latency.
2016:07:06 09:11:28,1550 records sent, 309.9 records/sec (30.27 MB/sec), 1.8 ms avg latency, 45.0 max latency.
2016:07:06 09:11:33,1547 records sent, 309.4 records/sec (30.21 MB/sec), 2.0 ms avg latency, 42.0 max latency.
2016:07:06 09:11:38,1545 records sent, 308.9 records/sec (30.17 MB/sec), 2.2 ms avg latency, 45.0 max latency.
2016:07:06 09:11:43,1550 records sent, 310.0 records/sec (30.27 MB/sec), 2.9 ms avg latency, 62.0 max latency.
2016:07:06 09:11:48,1549 records sent, 309.7 records/sec (30.25 MB/sec), 1.8 ms avg latency, 36.0 max latency.
2016:07:06 09:11:53,1538 records sent, 307.6 records/sec (30.04 MB/sec), 4.0 ms avg latency, 81.0 max latency.
2016:07:06 09:11:58,1544 records sent, 308.8 records/sec (30.16 MB/sec), 23.0 ms avg latency, 398.0 max latency.
2016:07:06 09:12:03,1532 records sent, 306.3 records/sec (29.92 MB/sec), 2.1 ms avg latency, 40.0 max latency.
2016:07:06 09:12:08,1527 records sent, 305.4 records/sec (29.82 MB/sec), 2.5 ms avg latency, 53.0 max latency.
2016:07:06 09:12:13,1539 records sent, 307.7 records/sec (30.05 MB/sec), 2.3 ms avg latency, 52.0 max latency.
2016:07:06 09:12:18,1542 records sent, 308.3 records/sec (30.11 MB/sec), 2.5 ms avg latency, 61.0 max latency.
2016:07:06 09:12:23,1550 records sent, 310.0 records/sec (30.27 MB/sec), 2.1 ms avg latency, 43.0 max latency.
2016:07:06 09:12:28,1551 records sent, 310.1 records/sec (30.28 MB/sec), 2.0 ms avg latency, 47.0 max latency.
2016:07:06 09:12:33,1547 records sent, 309.3 records/sec (30.21 MB/sec), 13.9 ms avg latency, 280.0 max latency.
2016:07:06 09:12:38,1552 records sent, 310.4 records/sec (30.31 MB/sec), 2.0 ms avg latency, 53.0 max latency.
2016:07:06 09:12:43,1545 records sent, 308.9 records/sec (30.16 MB/sec), 2.1 ms avg latency, 46.0 max latency.
2016:07:06 09:12:48,1550 records sent, 309.9 records/sec (30.27 MB/sec), 13.8 ms avg latency, 296.0 max latency.
2016:07:06 09:12:53,1549 records sent, 309.6 records/sec (30.24 MB/sec), 2.1 ms avg latency, 44.0 max latency.
2016:07:06 09:12:58,1544 records sent, 308.7 records/sec (30.14 MB/sec), 1.9 ms avg latency, 47.0 max latency.
2016:07:06 09:13:03,1546 records sent, 309.1 records/sec (30.19 MB/sec), 2.4 ms avg latency, 46.0 max latency.
2016:07:06 09:13:08,1549 records sent, 309.8 records/sec (30.25 MB/sec), 2.3 ms avg latency, 62.0 max latency.
2016:07:06 09:13:13,1551 records sent, 310.1 records/sec (30.29 MB/sec), 1.8 ms avg latency, 41.0 max latency.
2016:07:06 09:13:18,1547 records sent, 309.4 records/sec (30.21 MB/sec), 4.4 ms avg latency, 75.0 max latency.
2016:07:06 09:13:23,1549 records sent, 309.7 records/sec (30.24 MB/sec), 7.1 ms avg latency, 133.0 max latency.
2016:07:06 09:13:28,1551 records sent, 309.8 records/sec (30.25 MB/sec), 1.8 ms avg latency, 40.0 max latency.
2016:07:06 09:13:33,1554 records sent, 310.7 records/sec (30.34 MB/sec), 2.2 ms avg latency, 39.0 max latency.
2016:07:06 09:13:38,1549 records sent, 309.7 records/sec (30.24 MB/sec), 2.7 ms avg latency, 47.0 max latency.
2016:07:06 09:13:43,1547 records sent, 309.3 records/sec (30.20 MB/sec), 1.9 ms avg latency, 40.0 max latency.
2016:07:06 09:13:48,1551 records sent, 310.2 records/sec (30.29 MB/sec), 2.6 ms avg latency, 51.0 max latency.
2016:07:06 09:13:52,126000 records sent, 303.634944 records/sec (29.65 MB/sec), 162.43 ms avg latency, 2980.00 ms max latency, 2 ms 50th, 1463 ms 95th, 2053 ms 99th, 2717 ms 99.9th.